{
  "movies": [
    {
      "id": "1",
      "title": "Capitão América: Admirável Mundo Novo",
      "image": "https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcSIUfdySawxK4dbASkVb4zNpqEToBFEpHN-fgJciLL1-mnRZwEQ",
      "description": "Capitão América: Admirável Mundo Novo é o próximo filme do famoso herói da Marvel. Desta vez, o filme dá continuidade à minissérie de televisão Falcão e o Soldado Invernal, onde o escudo está nas mãos de Sam Wilson (Anthony Mackie), após Steve Rogers (Chris Evans) o entregar em Vingadores: Ultimato. Durante a série, Sam aceita seu dever como o novo Capitão América ao lado de Bucky Barnes (Sebastian Stan). Admirável Mundo Novo compõe a Fase Cinco do Universo Cinematográfico Marvel (UCM). O enredo promete explorar os desafios e responsabilidades de Wilson em seu novo papel, enquanto enfrenta novas ameaças e aliados inesperados. A direção está a cargo de Julius Onah, conhecido por seu trabalho em The Cloverfield Paradox, e o roteiro foi escrito por Malcolm Spellman, que também foi o showrunner de Falcão e o Soldado Invernal.",
      "link": "https://www.youtube.com/watch?v=-YhegkTNdk4"
    },
    {
      "id": "2",
      "title": "O Macaco",
      "image": "https://br.web.img2.acsta.net/img/d2/e5/d2e517612de9e1db2463aeec34dc6d29.jpg",
      "description": "O Macaco é dirigido e coescrito por Osgood Perkins (Longlegs) e produzido por James Wan (Jogos Mortais, Annabelle, M3gan). A trama acompanha os gêmeos Bill e Hal (Theo James), que descobrem um antigo macaco de brinquedo no sótão de seu pai. A partir desse momento, uma série de mortes terríveis começa a acontecer. Tentando se livrar do brinquedo e seguir em frente, os irmãos decidem descartá-lo e, com o tempo, distanciam-se desse passado sombrio. No entanto, o terror parece não os abandonar. O elenco também inclui Elijah Wood, Tatiana Maslany e Christian Convery. Stephen King assina o roteiro ao lado de Perkins, garantindo que o filme capture a essência aterrorizante de sua obra original. O Macaco promete ser uma adaptação intensa e envolvente do conto de King.\n\n",
      "link": "https://www.youtube.com/watch?v=ZWdhgGTAelE"
    },
    {
      "id": "3",
      "title": "Ainda Estou Aqui",
      "image": "https://gvshopping.com.br/wp-content/webp-express/webp-images/uploads/2024/11/9de5c6b8-7295-4e18-8c03-f07b69814fa8.jpg.webp",
      "description": "Ainda Estou Aqui é uma adaptação cinematográfica do livro autobiográfico de Marcelo Rubens Paiva, que narra a emocionante trajetória de sua mãe, Eunice Paiva, durante a ditadura militar no Brasil. Ambientada em 1970, a história retrata como a vida de uma mulher casada com um importante político muda drasticamente após o desaparecimento dele, capturado pelo regime militar. Forçada a abandonar a rotina de dona de casa, Eunice (Fernanda Torres/Fernanda Montenegro) se transforma em uma ativista dos direitos humanos, lutando pela verdade sobre o paradeiro do marido e enfrentando as consequências brutais da repressão. O filme explora não apenas o drama pessoal de Eunice, mas também o impacto do regime militar na vida de milhares de famílias brasileiras, destacando o papel das mulheres na resistência. Com uma narrativa profunda e sensível, Ainda Estou Aqui traz à tona questões de perda, coragem e resiliência, enquanto revisita um dos períodos mais sombrios da história do Brasil. A obra é um tributo à força de Eunice Paiva, que, contra todas as adversidades, se torna uma figura central na luta pelos direitos humanos no país.",
      "link": "https://www.youtube.com/watch?v=gDunV808Yf4"
    },
    {
      "id": "4",
      "title": "Flow",
      "image": "https://maceioshopping.com/app/uploads/2025/02/flow-poster.jpg",
      "description": "Em Flow, o mundo parece ter chegado ao fim, coberto apenas por vestígios da presença humana, mas sem nenhum por perto. O gato é um animal solitário que, um dia, enquanto é perseguido por uma manada de cães, vê seu lar ser devastado por uma grande enchente. Buscando uma forma de sobreviver após a inundação, ele enfrenta diferentes ameaças, até que encontra refúgio em um pequeno barco povoado por diversas espécies. Enquanto tentam fugir de toda essa situação hostil, os animais terão que se unir apesar de suas diferenças. Nesse veleiro, navegando por paisagens místicas e transbordantes, eles passam pelos desafios e perigos da adaptação a este novo cenário pós-apocalíptico. Flow acompanha uma aventura por entre as ruínas de um mundo inundado e destruído e os sobreviventes que buscam permanecer à deriva com a ajuda e esperança de cada um.\n\n",
      "link": "https://www.youtube.com/watch?v=Gl7uxk60m0o"
    },
    {
      "id": "5",
      "title": "Mufasa: O Rei Leão",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQvPMCE0yPnTrwhtED3r-CukIQMKOJ1y2dAEQ&s",
      "description": "Prólogo do live action de Rei Leão, produzido pela Disney e dirigido por Barry Jenkins, o longa contará a história de Mufasa e Scar antes de Simba. A trama tem a ajuda de Rafiki, Timão e Pumba, que juntos contam a lenda de Mufasa à jovem filhote de leão Kiara, filha de Simba e Nala. Narrado através de flashbacks, a história apresenta Mufasa como um filhote órfão, perdido e sozinho até que ele conhece um simpático leão chamado Taka – o herdeiro de uma linhagem real. O encontro ao acaso dá início a uma grande jornada de um grupo extraordinário de deslocados em busca de seu destino, além de revelar a ascensão de um dos maiores reis das Terras do Orgulho.",
      "link": "https://www.youtube.com/watch?v=Fg7tIazk3tk"
    },
    {
      "id": "6",
      "title": "Uma Advogada Brilhante",
      "image": "https://ingresso-a.akamaihd.net/prd/img/movie/uma-advogada-brilhante/e94e6aca-ebf3-48af-819d-4e4ebc2600c4.webp ",
      "description": "Uma Advogada Brilhante acompanha a história de Michelle, mais conhecido como Mike (Leandro Hassum) um advogado promissor, enfrenta um grande desafio pessoal e profissional. Além de lidar com a constante confusão envolvendo seu nome de origem italiana, frequentemente associado a um nome feminino, ele está pressionado pela necessidade de arcar com todas as despesas de seu filho, sob a ameaça de sua ex-esposa deixar o Brasil com o garoto. Quando a empresa onde trabalha é adquirida pelo maior escritório de advocacia do país, Michelle vê uma oportunidade de crescer. Contudo, o novo escritório decide demitir vários funcionários, incluindo ele, na tentativa de equilibrar a quantidade de homens e mulheres. No entanto, por conta da confusão com seu nome, ele é salvo da demissão, desde que assuma a identidade de uma mulher. Decidido a manter seu emprego e garantir a guarda do filho, Michelle adota o disfarce de Dra. Michele. No entanto, manter essa farsa no ambiente de trabalho se torna muito mais complicado do que ele previa.",
      "link": "https://www.youtube.com/watch?v=QEjm-p-IDCg"
    },
    {
      "id": "7",
      "title": "Mickey 17",
      "image": "https://br.web.img2.acsta.net/c_310_420/img/d4/c0/d4c0542e0a90a9bb353e3d96711b74e0.jpg",
      "description": "Baseado no livro de Edward Ashton, Mickey 17 é uma intrigante ficção científica que acompanha Mickey Barnes (Robert Pattinson), um homem consumível enviado em uma missão suicida para colonizar o planeta gelado de Niflheim. Como parte de um grupo descartável, cada integrante é designado a tarefas perigosas, e quando morre, suas memórias são transferidas para um novo corpo, um clone que continua a missão sem interrupções. Após seis mortes, Mickey começa a perceber que sua existência não é tão simples quanto parece. Confrontado com os segredos sombrios por trás de sua repetitiva jornada, ele se vê diante de escolhas que podem abalar a ordem estabelecida e alterar o destino da missão. Uma história de sobrevivência, identidade e revolução no coração de um mundo alienígena.",
      "link": "https://www.youtube.com/watch?v=GQUAxORWmqc"
    },
    {
      "id": "8",
      "title": "Minecraft",
      "image": "https://br.web.img3.acsta.net/img/ec/9e/ec9ec53e8a23b4f934bcb0ae2b4ee0b1.jpg",
      "description": "Um Filme Minecraft é a primeira adaptação live-action para os cinemas do jogo mais vendido de todos os tempos, Minecraft. Neste universo onde a criatividade não só proporciona diversão como também é vital para a sobrevivência, quatro indivíduos desajustados — Garrett arrett “The Garbage Man” Garrison (Jason Momoa), Henry (Sebastian Eugene Hansen), Natalie (Emma Myers) e Dawn (Danielle Brooks) — são subitamente transportados para o Overworld, um mundo cúbico e bizarro onde a imaginação reina. Após passarem por um portal misterioso, eles se encontram em uma terra repleta de perigos e criaturas malignas, como Piglins e Zumbis. Para retornarem ao seu mundo, eles terão que dominar este novo ambiente com a ajuda de um construtor experiente e imprevisível, Steve (Jack Black). Durante essa jornada mágica, os cinco aventureiros precisarão redescobrir suas habilidades únicas, essenciais não apenas para sobreviver no Overworld, mas também para prosperar na vida real.",
      "link": "https://www.youtube.com/watch?v=Z5bfhDMi-_I"
    }
  ],
  "users": [
    {
      "id": "1",
      "user": "admin",
      "pass": "1234",
      "photo": "",
      "favorites": []
    },
    {
      "id": "2",
      "user": "joao",
      "pass": "senha123",
      "photo": "",
      "favorites": []
    },
    {
      "id": "3",
      "user": "maria",
      "pass": "minhasenha",
      "photo": "",
      "favorites": []
    }
  ]
}